In [1]:
import pandas as pd

In [4]:
## now read the sales1_data
df=pd.read_csv("sales1_data.csv")
df.head(5)

         Date   Product  Sales Region
0  2023-01-01  Product3  738.0   West
1  2023-01-02  Product2  868.0  North
2  2023-01-03  Product2  554.0   West
3  2023-01-04  Product1  618.0  South
4  2023-01-05  Product3  501.0   East

In [5]:
df.tail(5)

          Date   Product  Sales Region
20  2023-01-21  Product2    NaN   West
21  2023-01-22  Product3  296.0   West
22  2023-01-23  Product2  737.0   West
23  2023-01-24  Product3  531.0   East
24  2023-01-25  Product2  834.0  North

In [6]:
df.describe()

            Sales
count   19.000000
mean   554.000000
std    231.543372
min    124.000000
25%    381.500000
50%    554.000000
75%    737.500000
max    868.000000

In [7]:
df.dtypes

Date        object
Product     object
Sales      float64
Region      object
dtype: object

In [8]:
## checking missing val
df.isnull()

     Date  Product  Sales  Region
0   False    False  False   False
1   False    False  False   False
2   False    False  False   False
3   False    False  False   False
4   False    False  False   False
5   False    False   True   False
6   False    False  False   False
7   False    False  False   False
8   False    False  False   False
9   False    False  False   False
10  False    False  False   False
11  False    False   True   False
12  False    False   True   False
13  False    False  False   False
14  False    False  False   False
15  False    False  False   False
16  False    False   True   False
17  False    False   True   False
18  False    False  False   False
19  False    False  False   False
20  False    False   True   False
21  False    False  False   False
22  False    False  False   False
23  False    False  False   False
24  False    False  False   False

In [9]:
df.isnull().any()

Date       False
Product    False
Sales       True
Region     False
dtype: bool

In [10]:
df.isnull().sum()

Date       0
Product    0
Sales      6
Region     0
dtype: int64

In [11]:
df_filled=df.fillna(0)

In [13]:
df

          Date   Product  Sales Region
0   2023-01-01  Product3  738.0   West
1   2023-01-02  Product2  868.0  North
2   2023-01-03  Product2  554.0   West
3   2023-01-04  Product1  618.0  South
4   2023-01-05  Product3  501.0   East
5   2023-01-06  Product1    NaN   West
6   2023-01-07  Product3  339.0  South
7   2023-01-08  Product3  280.0  South
8   2023-01-09  Product2  806.0  North
9   2023-01-10  Product2  816.0  South
10  2023-01-11  Product3  469.0   West
11  2023-01-12  Product3    NaN   East
12  2023-01-13  Product3    NaN   East
13  2023-01-14  Product3  676.0   East
14  2023-01-15  Product1  183.0  South
15  2023-01-16  Product1  424.0  South
16  2023-01-17  Product1    NaN  South
17  2023-01-18  Product1    NaN  South
18  2023-01-19  Product2  124.0  North
19  2023-01-20  Product3  732.0   West
20  2023-01-21  Product2    NaN   West
21  2023-01-22  Product3  296.0   West
22  2023-01-23  Product2  737.0   West
23  2023-01-24  Product3  531.0   East
24  2023-01-25  Product2  834.0  North

In [ ]:
  df.fillna(df['Sales'].mean())  ##temparory

          Date   Product  Sales Region
0   2023-01-01  Product3  738.0   West
1   2023-01-02  Product2  868.0  North
2   2023-01-03  Product2  554.0   West
3   2023-01-04  Product1  618.0  South
4   2023-01-05  Product3  501.0   East
5   2023-01-06  Product1  554.0   West
6   2023-01-07  Product3  339.0  South
7   2023-01-08  Product3  280.0  South
8   2023-01-09  Product2  806.0  North
9   2023-01-10  Product2  816.0  South
10  2023-01-11  Product3  469.0   West
11  2023-01-12  Product3  554.0   East
12  2023-01-13  Product3  554.0   East
13  2023-01-14  Product3  676.0   East
14  2023-01-15  Product1  183.0  South
15  2023-01-16  Product1  424.0  South
16  2023-01-17  Product1  554.0  South
17  2023-01-18  Product1  554.0  South
18  2023-01-19  Product2  124.0  North
19  2023-01-20  Product3  732.0   West
20  2023-01-21  Product2  554.0   West
21  2023-01-22  Product3  296.0   West
22  2023-01-23  Product2  737.0   West
23  2023-01-24  Product3  531.0   East
24  2023-01-25  Product2  834.0  North

In [15]:
df

          Date   Product  Sales Region
0   2023-01-01  Product3  738.0   West
1   2023-01-02  Product2  868.0  North
2   2023-01-03  Product2  554.0   West
3   2023-01-04  Product1  618.0  South
4   2023-01-05  Product3  501.0   East
5   2023-01-06  Product1    NaN   West
6   2023-01-07  Product3  339.0  South
7   2023-01-08  Product3  280.0  South
8   2023-01-09  Product2  806.0  North
9   2023-01-10  Product2  816.0  South
10  2023-01-11  Product3  469.0   West
11  2023-01-12  Product3    NaN   East
12  2023-01-13  Product3    NaN   East
13  2023-01-14  Product3  676.0   East
14  2023-01-15  Product1  183.0  South
15  2023-01-16  Product1  424.0  South
16  2023-01-17  Product1    NaN  South
17  2023-01-18  Product1    NaN  South
18  2023-01-19  Product2  124.0  North
19  2023-01-20  Product3  732.0   West
20  2023-01-21  Product2    NaN   West
21  2023-01-22  Product3  296.0   West
22  2023-01-23  Product2  737.0   West
23  2023-01-24  Product3  531.0   East
24  2023-01-25  Product2  834.0  North

In [16]:
df['Sales_filled_mean']=df['Sales'].fillna(df["Sales"].mean())

In [18]:
df

          Date   Product  Sales Region  Sales_filled_mean
0   2023-01-01  Product3  738.0   West              738.0
1   2023-01-02  Product2  868.0  North              868.0
2   2023-01-03  Product2  554.0   West              554.0
3   2023-01-04  Product1  618.0  South              618.0
4   2023-01-05  Product3  501.0   East              501.0
5   2023-01-06  Product1    NaN   West              554.0
6   2023-01-07  Product3  339.0  South              339.0
7   2023-01-08  Product3  280.0  South              280.0
8   2023-01-09  Product2  806.0  North              806.0
9   2023-01-10  Product2  816.0  South              816.0
10  2023-01-11  Product3  469.0   West              469.0
11  2023-01-12  Product3    NaN   East              554.0
12  2023-01-13  Product3    NaN   East              554.0
13  2023-01-14  Product3  676.0   East              676.0
14  2023-01-15  Product1  183.0  South              183.0
15  2023-01-16  Product1  424.0  South              424.0
16  2023-01-17  Product1    NaN  South              554.0
17  2023-01-18  Product1    NaN  South              554.0
18  2023-01-19  Product2  124.0  North              124.0
19  2023-01-20  Product3  732.0   West              732.0
20  2023-01-21  Product2    NaN   West              554.0
21  2023-01-22  Product3  296.0   West              296.0
22  2023-01-23  Product2  737.0   West              737.0
23  2023-01-24  Product3  531.0   East              531.0
24  2023-01-25  Product2  834.0  North              834.0

In [19]:
df.dtypes

Date                  object
Product               object
Sales                float64
Region                object
Sales_filled_mean    float64
dtype: object

In [23]:
df=df.rename(columns={'Product':'Products'})

In [24]:
df

          Date  Products  Sales Region  Sales_filled_mean
0   2023-01-01  Product3  738.0   West              738.0
1   2023-01-02  Product2  868.0  North              868.0
2   2023-01-03  Product2  554.0   West              554.0
3   2023-01-04  Product1  618.0  South              618.0
4   2023-01-05  Product3  501.0   East              501.0
5   2023-01-06  Product1    NaN   West              554.0
6   2023-01-07  Product3  339.0  South              339.0
7   2023-01-08  Product3  280.0  South              280.0
8   2023-01-09  Product2  806.0  North              806.0
9   2023-01-10  Product2  816.0  South              816.0
10  2023-01-11  Product3  469.0   West              469.0
11  2023-01-12  Product3    NaN   East              554.0
12  2023-01-13  Product3    NaN   East              554.0
13  2023-01-14  Product3  676.0   East              676.0
14  2023-01-15  Product1  183.0  South              183.0
15  2023-01-16  Product1  424.0  South              424.0
16  2023-01-17  Product1    NaN  South              554.0
17  2023-01-18  Product1    NaN  South              554.0
18  2023-01-19  Product2  124.0  North              124.0
19  2023-01-20  Product3  732.0   West              732.0
20  2023-01-21  Product2    NaN   West              554.0
21  2023-01-22  Product3  296.0   West              296.0
22  2023-01-23  Product2  737.0   West              737.0
23  2023-01-24  Product3  531.0   East              531.0
24  2023-01-25  Product2  834.0  North              834.0

In [25]:
df.head()

         Date  Products  Sales Region  Sales_filled_mean
0  2023-01-01  Product3  738.0   West              738.0
1  2023-01-02  Product2  868.0  North              868.0
2  2023-01-03  Product2  554.0   West              554.0
3  2023-01-04  Product1  618.0  South              618.0
4  2023-01-05  Product3  501.0   East              501.0

In [27]:
## now filled int in sales_filled_mean
df["Int_Sales"]=df["Sales"].fillna(df['Sales'].mean()).astype(int)

In [28]:
df.head()

         Date  Products  Sales Region  Sales_filled_mean  Int_Sales
0  2023-01-01  Product3  738.0   West              738.0        738
1  2023-01-02  Product2  868.0  North              868.0        868
2  2023-01-03  Product2  554.0   West              554.0        554
3  2023-01-04  Product1  618.0  South              618.0        618
4  2023-01-05  Product3  501.0   East              501.0        501

In [29]:
df['New_Value']=df["Sales"].apply(lambda x: x*2)

In [30]:
df.head()

         Date  Products  Sales Region  Sales_filled_mean  Int_Sales  New_Value
0  2023-01-01  Product3  738.0   West              738.0        738     1476.0
1  2023-01-02  Product2  868.0  North              868.0        868     1736.0
2  2023-01-03  Product2  554.0   West              554.0        554     1108.0
3  2023-01-04  Product1  618.0  South              618.0        618     1236.0
4  2023-01-05  Product3  501.0   East              501.0        501     1002.0

In [31]:
grouped_mean=df.groupby("Products")["Sales"].mean()

In [32]:
grouped_mean

Products
Product1    408.333333
Product2    677.000000
Product3    506.888889
Name: Sales, dtype: float64

In [35]:
grouped_agg=df.groupby(["Products","Region"])["Sales"].sum()

In [37]:
grouped_agg

Products  Region
Product1  South     1225.0
          West         0.0
Product2  North     2632.0
          South      816.0
          West      1291.0
Product3  East      1708.0
          South      619.0
          West      2235.0
Name: Sales, dtype: float64

In [40]:
df1=pd.DataFrame({'key1':[1,2,3,4],'value1':['A','B','C','D']})
df2=pd.DataFrame({'key2':[1,2,3,4],'value2':['A','B','C','D']})

In [41]:
pd.merge(df1, df2, how="cross")

    key1 value1  key2 value2
0      1      A     1      A
1      1      A     2      B
2      1      A     3      C
3      1      A     4      D
4      2      B     1      A
5      2      B     2      B
6      2      B     3      C
7      2      B     4      D
8      3      C     1      A
9      3      C     2      B
10     3      C     3      C
11     3      C     4      D
12     4      D     1      A
13     4      D     2      B
14     4      D     3      C
15     4      D     4      D

In [42]:
df1=pd.DataFrame({'key':[1,2,3,4],'value1':['A','B','C','D']})
df2=pd.DataFrame({'key':[1,2,3,4],'value2':['A','B','C','D']})

In [43]:
pd.merge(df1,df2,on="key",how="inner")

   key value1 value2
0    1      A      A
1    2      B      B
2    3      C      C
3    4      D      D

In [44]:
pd.merge(df1,df2,on="key",how="left")

   key value1 value2
0    1      A      A
1    2      B      B
2    3      C      C
3    4      D      D